# Exercicios

## Ex 00

In [1]:
import pandas as pd
data = [['Fulano', 12, 7.0, True],
        ['Sicrano', 15, 3.5, False], 
        ['Beltrano', 18, 9.3, True]]
dados = pd.DataFrame(data, 
        columns = ['Aluno', 'Idade', 'Nota', 'Aprovado'])
dados

      Aluno  Idade  Nota  Aprovado
0    Fulano     12   7.0      True
1   Sicrano     15   3.5     False
2  Beltrano     18   9.3      True

In [4]:
tdados = dados.dtypes

In [6]:
tipo_dados = pd.DataFrame(tdados, columns = ['Tipos de Dados'])

In [10]:
tipo_dados.columns.name = 'Variáveis'

In [11]:
tipo_dados

Variáveis Variáveis
Aluno        object
Idade         int64
Nota        float64
Aprovado       bool